# DisplayUnitSystem Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..DisplayUnitSystem Property
Document Class See Also
---
Provides access to display unit type with in the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DisplayUnit DisplayUnitSystem { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DisplayUnitSystem As DisplayUnit
	Get
```

Visual C++
---
```text
public:
property DisplayUnit DisplayUnitSystem {
	DisplayUnit get ();
}
```

# Remarks
Return the display unit type, metric or imperial.
# See Also
Document Class
Autodesk.Revit.DB Namespace